-- phpMyAdmin SQL Dump
-- version 5.2.3
-- https://www.phpmyadmin.net/
--
-- Хост: MySQL-8.4:3306
-- Время создания: Май 11 2026 г., 21:09
-- Версия сервера: 8.4.7
-- Версия PHP: 8.5.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `mtsoc_messenger`
--

-- --------------------------------------------------------

--
-- Структура таблицы `chats`
--

CREATE TABLE `chats` (
  `id` int NOT NULL,
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `type` enum('private','group','system','class','subject','admin','support','favorite') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'private',
  `school_id` int DEFAULT NULL,
  `is_pinned` tinyint(1) DEFAULT '0',
  `created_by` int DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `avatar_type` enum('default','group','class','subject','event','favorite','support','admin','robot') CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT 'default',
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `settings` json DEFAULT NULL,
  `last_message_id` bigint DEFAULT NULL,
  `last_message_at` timestamp NULL DEFAULT NULL,
  `is_encrypted` tinyint(1) DEFAULT '0',
  `encryption_key` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `chats`
--

INSERT INTO `chats` (`id`, `name`, `type`, `school_id`, `is_pinned`, `created_by`, `created_at`, `updated_at`, `avatar_type`, `description`, `settings`, `last_message_id`, `last_message_at`, `is_encrypted`, `encryption_key`) VALUES
(1, NULL, 'private', 1, 0, 2, '2026-04-25 10:00:00', '2026-04-25 10:00:00', 'default', 'Личный чат', NULL, NULL, NULL, 0, NULL),
(2, '1А - Общий чат', 'class', 1, 0, 3, '2026-04-25 10:00:00', '2026-04-25 10:00:00', 'class', 'Чат класса 1А', NULL, NULL, NULL, 0, NULL),
(3, '1а', 'class', 2, 0, 6, '2026-04-25 10:20:52', '2026-04-25 12:10:52', 'default', 'чат класса', NULL, 31, '2026-04-25 12:10:52', 0, NULL),
(4, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:04:48', '2026-04-25 11:04:48', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(5, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:04:49', '2026-04-25 11:04:49', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(6, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:04:51', '2026-04-25 11:04:51', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(7, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:04:52', '2026-04-25 11:04:52', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(8, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:04:53', '2026-04-25 11:04:53', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(9, NULL, 'private', 2, 0, 6, '2026-04-25 11:04:53', '2026-04-25 11:04:53', 'default', NULL, NULL, NULL, NULL, 0, NULL),
(10, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:04:54', '2026-04-25 11:04:54', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(11, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:04:57', '2026-04-25 11:04:57', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(12, NULL, 'private', 2, 0, 6, '2026-04-25 11:04:57', '2026-04-25 11:04:57', 'default', NULL, NULL, NULL, NULL, 0, NULL),
(13, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:04:58', '2026-04-25 11:04:58', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(14, NULL, 'private', 2, 0, 6, '2026-04-25 11:04:58', '2026-04-25 11:13:41', 'default', NULL, NULL, 16, '2026-04-25 11:13:41', 0, NULL),
(15, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:04:59', '2026-04-25 11:04:59', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(16, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:05:00', '2026-04-25 11:05:00', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(17, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:05:19', '2026-04-25 11:05:19', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(18, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:05:21', '2026-04-25 11:05:21', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(19, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:05:23', '2026-04-25 11:05:23', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(20, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:05:26', '2026-04-25 11:05:26', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(21, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:01', '2026-04-25 11:06:01', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(22, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:02', '2026-04-25 11:06:02', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(23, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:03', '2026-04-25 11:06:03', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(24, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:05', '2026-04-25 11:06:05', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(25, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:06', '2026-04-25 11:06:06', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(26, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:07', '2026-04-25 11:06:07', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(27, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:09', '2026-04-25 11:06:09', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(28, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:10', '2026-04-25 11:06:10', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(29, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:15', '2026-04-25 11:06:15', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(30, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:18', '2026-04-25 11:06:18', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(31, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:19', '2026-04-25 11:06:19', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(32, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:21', '2026-04-25 11:06:21', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(33, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:23', '2026-04-25 11:06:23', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(34, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:24', '2026-04-25 11:06:24', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(35, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:25', '2026-04-25 11:06:25', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(36, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:25', '2026-04-25 11:06:25', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(37, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:28', '2026-04-25 11:06:28', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(38, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:28', '2026-04-25 11:06:28', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(39, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:32', '2026-04-25 11:06:32', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(40, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:32', '2026-04-25 11:06:32', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(41, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:33', '2026-04-25 11:06:33', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(42, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:33', '2026-04-25 11:06:33', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(43, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:55', '2026-04-25 11:06:55', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(44, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:56', '2026-04-25 11:06:56', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(45, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:57', '2026-04-25 11:06:57', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(46, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:59', '2026-04-25 11:06:59', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(47, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:06:59', '2026-04-25 11:06:59', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(48, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:07:00', '2026-04-25 11:07:00', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(49, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:07:00', '2026-04-25 11:07:00', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(50, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:07:57', '2026-04-25 11:07:57', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(51, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:07:58', '2026-04-25 11:07:58', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(52, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:07:58', '2026-04-25 11:07:58', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(53, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:07:59', '2026-04-25 11:07:59', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(54, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:07:59', '2026-04-25 11:07:59', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(55, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:08:00', '2026-04-25 11:08:00', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(56, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:08:00', '2026-04-25 11:08:00', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(57, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:08:01', '2026-04-25 11:08:01', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(58, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:08:02', '2026-04-25 11:08:02', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(59, NULL, 'private', 2, 0, 9, '2026-04-25 11:08:02', '2026-04-25 11:08:02', 'default', NULL, NULL, NULL, NULL, 0, NULL),
(60, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:08:02', '2026-04-25 11:08:02', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(61, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:08:03', '2026-04-25 11:08:03', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(62, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:08:04', '2026-04-25 11:08:04', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(63, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:08:04', '2026-04-25 11:08:04', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(64, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:08:05', '2026-04-25 11:08:05', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(65, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:08:05', '2026-04-25 11:08:05', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(66, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:08:06', '2026-04-25 11:08:06', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(67, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:08:06', '2026-04-25 11:08:06', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(68, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:08:07', '2026-04-25 11:08:07', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(69, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:08:08', '2026-04-25 11:08:08', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(70, NULL, 'private', 2, 0, 9, '2026-04-25 11:08:08', '2026-04-25 11:22:46', 'default', NULL, NULL, 21, '2026-04-25 11:22:46', 0, NULL),
(71, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:08:08', '2026-04-25 11:08:08', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(72, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:10:02', '2026-04-25 11:10:02', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(73, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:10:03', '2026-04-25 11:10:03', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(74, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:10:04', '2026-04-25 11:10:04', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(75, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:10:06', '2026-04-25 11:10:06', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(76, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:10:06', '2026-04-25 11:10:06', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(77, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:10:06', '2026-04-25 11:10:06', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(78, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:10:06', '2026-04-25 11:10:06', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(79, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:10:54', '2026-04-25 11:10:54', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(80, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:10:55', '2026-04-25 11:10:55', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(81, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:10:56', '2026-04-25 11:10:56', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(82, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:10:56', '2026-04-25 11:10:56', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(83, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:01', '2026-04-25 11:11:01', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(84, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:02', '2026-04-25 11:11:02', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(85, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:02', '2026-04-25 11:11:02', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(86, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:08', '2026-04-25 11:11:08', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(87, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:30', '2026-04-25 11:11:30', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(88, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:31', '2026-04-25 11:11:31', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(89, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:32', '2026-04-25 11:11:32', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(90, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:33', '2026-04-25 11:11:33', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(91, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:34', '2026-04-25 11:11:34', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(92, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:34', '2026-04-25 11:11:34', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(93, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:35', '2026-04-25 11:11:35', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(94, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:35', '2026-04-25 11:11:35', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(95, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:49', '2026-04-25 11:11:49', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(96, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:49', '2026-04-25 11:11:49', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(97, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:51', '2026-04-25 11:11:51', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(98, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:57', '2026-04-25 11:11:57', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(99, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:57', '2026-04-25 11:11:57', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(100, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:57', '2026-04-25 11:11:57', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(101, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:58', '2026-04-25 11:11:58', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(102, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:59', '2026-04-25 11:11:59', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(103, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:11:59', '2026-04-25 11:11:59', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(104, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:12:02', '2026-04-25 11:12:02', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(105, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:12:20', '2026-04-25 11:12:20', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(106, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:12:20', '2026-04-25 11:12:20', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(107, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:12:21', '2026-04-25 11:12:21', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(108, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:12:22', '2026-04-25 11:12:22', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(109, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:12:22', '2026-04-25 11:12:22', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(110, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:12:23', '2026-04-25 11:12:23', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(111, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:12:23', '2026-04-25 11:12:23', 'default', 'Обращения к администрации', NULL, NULL, NULL, 0, NULL),
(112, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:13:34', '2026-04-25 11:13:34', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(113, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:13:35', '2026-04-25 11:13:35', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(114, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:13:37', '2026-04-25 11:13:37', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(115, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:13:38', '2026-04-25 11:13:38', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(116, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:13:41', '2026-04-25 11:13:41', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(117, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:13:44', '2026-04-25 11:13:44', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(118, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:13:45', '2026-04-25 11:13:45', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(119, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:13:45', '2026-04-25 11:13:45', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(120, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:13:47', '2026-04-25 11:13:47', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(121, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:13:48', '2026-04-25 11:13:48', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(122, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:13:49', '2026-04-25 11:13:49', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(123, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:13:49', '2026-04-25 11:13:49', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(124, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:16:16', '2026-04-25 11:16:16', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(125, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:16:22', '2026-04-25 11:16:22', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(126, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:16:27', '2026-04-25 11:16:27', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(127, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:16:29', '2026-04-25 11:16:29', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(128, 'Администрация школы', 'admin', 1, 1, NULL, '2026-04-25 11:17:21', '2026-04-25 11:17:21', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(129, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:18:22', '2026-04-25 11:18:22', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(130, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:18:23', '2026-04-25 11:18:23', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(131, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:18:24', '2026-04-25 11:18:24', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(132, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:18:25', '2026-04-25 11:18:25', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(133, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:18:25', '2026-04-25 11:18:25', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(134, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:18:25', '2026-04-25 11:18:25', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(135, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:18:25', '2026-04-25 11:18:25', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(136, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:18:27', '2026-04-25 11:18:27', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(137, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:18:28', '2026-04-25 11:18:28', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(138, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:18:28', '2026-04-25 11:18:28', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(139, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:18:29', '2026-04-25 11:18:29', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(140, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:18:29', '2026-04-25 11:18:29', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(141, '⭐ Избранное', 'favorite', NULL, 1, 1, '2026-04-25 11:21:02', '2026-04-25 11:21:02', 'default', 'Избранное', NULL, NULL, NULL, 0, NULL),
(142, '🔧 Техподдержка', 'support', NULL, 1, 1, '2026-04-25 11:21:02', '2026-04-25 11:21:02', 'default', 'Техническая поддержка', NULL, NULL, NULL, 0, NULL),
(143, '⭐ Избранное', 'favorite', 1, 1, 2, '2026-04-25 11:21:02', '2026-04-25 11:21:02', 'default', 'Избранное', NULL, NULL, NULL, 0, NULL),
(144, '🔧 Техподдержка', 'support', 1, 1, 2, '2026-04-25 11:21:02', '2026-04-25 11:21:02', 'default', 'Техническая поддержка', NULL, NULL, NULL, 0, NULL),
(145, '⭐ Избранное', 'favorite', 1, 1, 3, '2026-04-25 11:21:02', '2026-04-25 11:21:02', 'default', 'Избранное', NULL, NULL, NULL, 0, NULL),
(146, '🔧 Техподдержка', 'support', 1, 1, 3, '2026-04-25 11:21:02', '2026-04-25 11:21:02', 'default', 'Техническая поддержка', NULL, NULL, NULL, 0, NULL),
(147, '⭐ Избранное', 'favorite', 1, 1, 4, '2026-04-25 11:21:02', '2026-04-25 11:21:02', 'default', 'Избранное', NULL, NULL, NULL, 0, NULL),
(148, '🔧 Техподдержка', 'support', 1, 1, 4, '2026-04-25 11:21:02', '2026-04-25 11:21:02', 'default', 'Техническая поддержка', NULL, NULL, NULL, 0, NULL),
(149, '⭐ Избранное', 'favorite', NULL, 1, 5, '2026-04-25 11:21:02', '2026-04-25 11:21:02', 'default', 'Избранное', NULL, NULL, NULL, 0, NULL),
(150, '🔧 Техподдержка', 'support', NULL, 1, 5, '2026-04-25 11:21:02', '2026-04-25 11:21:02', 'default', 'Техническая поддержка', NULL, NULL, NULL, 0, NULL),
(151, '⭐ Избранное', 'favorite', 2, 1, 6, '2026-04-25 11:21:02', '2026-04-25 11:44:07', 'default', 'Избранное', NULL, 28, '2026-04-25 11:44:07', 0, NULL),
(152, '🔧 Техподдержка', 'support', 2, 1, 6, '2026-04-25 11:21:02', '2026-04-25 11:44:04', 'default', 'Техническая поддержка', NULL, 27, '2026-04-25 11:44:04', 0, NULL),
(153, '⭐ Избранное', 'favorite', 2, 1, 7, '2026-04-25 11:21:02', '2026-04-25 11:21:02', 'default', 'Избранное', NULL, NULL, NULL, 0, NULL),
(154, '🔧 Техподдержка', 'support', 2, 1, 7, '2026-04-25 11:21:02', '2026-04-25 11:21:02', 'default', 'Техническая поддержка', NULL, NULL, NULL, 0, NULL),
(155, '⭐ Избранное', 'favorite', 2, 1, 8, '2026-04-25 11:21:02', '2026-04-25 11:21:02', 'default', 'Избранное', NULL, NULL, NULL, 0, NULL),
(156, '🔧 Техподдержка', 'support', 2, 1, 8, '2026-04-25 11:21:02', '2026-04-25 11:21:02', 'default', 'Техническая поддержка', NULL, NULL, NULL, 0, NULL),
(157, '⭐ Избранное', 'favorite', 2, 1, 9, '2026-04-25 11:21:02', '2026-04-25 11:22:35', 'default', 'Избранное', NULL, 19, '2026-04-25 11:22:35', 0, NULL),
(158, '🔧 Техподдержка', 'support', 2, 1, 9, '2026-04-25 11:21:02', '2026-04-25 11:22:39', 'default', 'Техническая поддержка', NULL, 20, '2026-04-25 11:22:39', 0, NULL),
(159, '🏫 Администрация', 'admin', 1, 1, 1, '2026-04-25 11:21:02', '2026-04-25 11:21:02', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(160, '🏫 Администрация', 'admin', 2, 1, 1, '2026-04-25 11:21:02', '2026-04-25 11:44:10', 'default', 'Обращения к администрации школы', NULL, 29, '2026-04-25 11:44:10', 0, NULL),
(161, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:21:16', '2026-04-25 11:21:16', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(162, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:21:17', '2026-04-25 11:21:17', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(163, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:21:18', '2026-04-25 11:21:18', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(164, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:21:19', '2026-04-25 11:21:19', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(165, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:21:19', '2026-04-25 11:21:19', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(166, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:21:26', '2026-04-25 11:21:26', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(167, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:21:28', '2026-04-25 11:21:28', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(168, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:21:29', '2026-04-25 11:21:29', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(169, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:21:31', '2026-04-25 11:21:31', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(170, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:22:20', '2026-04-25 11:22:20', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(171, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:22:21', '2026-04-25 11:22:21', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(172, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:22:22', '2026-04-25 11:22:22', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(173, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:22:28', '2026-04-25 11:22:28', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(174, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:22:31', '2026-04-25 11:22:31', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(175, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:22:33', '2026-04-25 11:22:33', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(176, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:22:35', '2026-04-25 11:22:35', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(177, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:22:36', '2026-04-25 11:22:36', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(178, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:22:39', '2026-04-25 11:22:39', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(179, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:22:40', '2026-04-25 11:22:40', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(180, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:22:43', '2026-04-25 11:22:43', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(181, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:22:46', '2026-04-25 11:22:46', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(182, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:23:05', '2026-04-25 11:23:05', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(183, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:23:05', '2026-04-25 11:23:05', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(184, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:23:07', '2026-04-25 11:23:07', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(185, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:23:08', '2026-04-25 11:23:08', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(186, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:23:09', '2026-04-25 11:23:09', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(187, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:23:10', '2026-04-25 11:23:10', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(188, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:23:14', '2026-04-25 11:23:14', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(189, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:23:14', '2026-04-25 11:23:14', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(190, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:23:21', '2026-04-25 11:23:21', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(191, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:23:24', '2026-04-25 11:23:24', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(192, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:23:24', '2026-04-25 11:23:24', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(193, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:25:52', '2026-04-25 11:25:52', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(194, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:25:52', '2026-04-25 11:25:52', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(195, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:25:53', '2026-04-25 11:25:53', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(196, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:25:53', '2026-04-25 11:25:53', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(197, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:25:54', '2026-04-25 11:25:54', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(198, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:25:54', '2026-04-25 11:25:54', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(199, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:25:59', '2026-04-25 11:25:59', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(200, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:25:59', '2026-04-25 11:25:59', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(201, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:26:15', '2026-04-25 11:26:15', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(202, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:26:16', '2026-04-25 11:26:16', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(203, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:26:16', '2026-04-25 11:26:16', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(204, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:26:17', '2026-04-25 11:26:17', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(205, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:26:19', '2026-04-25 11:26:19', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(206, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:26:19', '2026-04-25 11:26:19', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(207, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:26:35', '2026-04-25 11:26:35', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(208, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:26:36', '2026-04-25 11:26:36', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(209, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:26:37', '2026-04-25 11:26:37', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(210, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:26:38', '2026-04-25 11:26:38', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(211, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:26:48', '2026-04-25 11:26:48', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(212, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:26:49', '2026-04-25 11:26:49', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(213, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:26:49', '2026-04-25 11:26:49', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(214, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:26:50', '2026-04-25 11:26:50', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(215, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:27:00', '2026-04-25 11:27:00', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(216, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:27:01', '2026-04-25 11:27:01', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(217, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:27:01', '2026-04-25 11:27:01', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(218, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:27:01', '2026-04-25 11:27:01', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(219, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:29:24', '2026-04-25 11:29:24', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(220, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:29:24', '2026-04-25 11:29:24', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(221, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:29:25', '2026-04-25 11:29:25', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(222, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:29:26', '2026-04-25 11:29:26', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(223, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:30:02', '2026-04-25 11:30:02', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(224, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:30:03', '2026-04-25 11:30:03', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(225, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:30:05', '2026-04-25 11:30:05', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(226, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:30:05', '2026-04-25 11:30:05', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(227, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:30:07', '2026-04-25 11:30:07', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(228, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:30:07', '2026-04-25 11:30:07', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(229, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:30:11', '2026-04-25 11:30:11', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(230, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:30:11', '2026-04-25 11:30:11', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(231, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:30:35', '2026-04-25 11:30:35', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(232, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:30:36', '2026-04-25 11:30:36', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(233, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:30:37', '2026-04-25 11:30:37', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(234, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:30:38', '2026-04-25 11:30:38', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(235, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:30:38', '2026-04-25 11:30:38', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(236, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:30:39', '2026-04-25 11:30:39', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(237, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:33:23', '2026-04-25 11:33:23', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(238, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:33:24', '2026-04-25 11:33:24', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(239, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:33:25', '2026-04-25 11:33:25', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(240, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:33:27', '2026-04-25 11:33:27', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(241, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:33:27', '2026-04-25 11:33:27', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(242, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:33:31', '2026-04-25 11:33:31', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(243, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:33:31', '2026-04-25 11:33:31', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(244, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:33:34', '2026-04-25 11:33:34', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(245, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:33:34', '2026-04-25 11:33:34', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(246, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:33:34', '2026-04-25 11:33:34', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(247, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:33:36', '2026-04-25 11:33:36', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(248, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:33:36', '2026-04-25 11:33:36', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(249, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:33:42', '2026-04-25 11:33:42', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(250, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:33:59', '2026-04-25 11:33:59', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(251, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:33:59', '2026-04-25 11:33:59', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(252, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:34:02', '2026-04-25 11:34:02', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(253, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:34:03', '2026-04-25 11:34:03', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(254, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:34:23', '2026-04-25 11:34:23', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(255, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:34:23', '2026-04-25 11:34:23', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(256, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:34:24', '2026-04-25 11:34:24', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(257, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:34:24', '2026-04-25 11:34:24', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(258, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:34:24', '2026-04-25 11:34:24', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(259, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:34:24', '2026-04-25 11:34:24', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(260, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:34:24', '2026-04-25 11:34:24', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(261, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:34:25', '2026-04-25 11:34:25', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(262, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:34:25', '2026-04-25 11:34:25', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(263, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:34:26', '2026-04-25 11:34:26', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(264, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:34:26', '2026-04-25 11:34:26', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(265, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:34:28', '2026-04-25 11:34:28', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(266, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:34:28', '2026-04-25 11:34:28', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(267, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:34:28', '2026-04-25 11:34:28', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(268, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:34:29', '2026-04-25 11:34:29', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(269, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:34:29', '2026-04-25 11:34:29', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(270, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:35:00', '2026-04-25 11:35:00', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(271, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:35:00', '2026-04-25 11:35:00', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(272, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:35:02', '2026-04-25 11:35:02', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(273, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:35:03', '2026-04-25 11:35:03', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(274, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:35:03', '2026-04-25 11:35:03', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(275, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:35:04', '2026-04-25 11:35:04', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(276, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:35:05', '2026-04-25 11:35:05', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(277, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:35:06', '2026-04-25 11:35:06', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(278, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:35:06', '2026-04-25 11:35:06', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(279, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:35:41', '2026-04-25 11:35:41', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(280, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:35:41', '2026-04-25 11:35:41', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(281, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:35:43', '2026-04-25 11:35:43', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(282, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:35:44', '2026-04-25 11:35:44', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(283, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:35:44', '2026-04-25 11:35:44', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(284, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:35:45', '2026-04-25 11:35:45', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(285, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:35:48', '2026-04-25 11:35:48', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(286, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:35:50', '2026-04-25 11:35:50', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(287, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:35:50', '2026-04-25 11:35:50', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(288, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:35:52', '2026-04-25 11:35:52', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(289, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:36:00', '2026-04-25 11:36:00', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(290, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:36:00', '2026-04-25 11:36:00', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(291, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:36:04', '2026-04-25 11:36:04', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(292, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:36:04', '2026-04-25 11:36:04', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(293, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:36:05', '2026-04-25 11:36:05', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(294, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:36:06', '2026-04-25 11:36:06', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(295, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:36:07', '2026-04-25 11:36:07', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(296, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:36:07', '2026-04-25 11:36:07', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(297, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:36:07', '2026-04-25 11:36:07', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(298, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:36:07', '2026-04-25 11:36:07', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(299, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:36:09', '2026-04-25 11:36:09', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(300, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:36:09', '2026-04-25 11:36:09', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(301, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:36:10', '2026-04-25 11:36:10', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL);
INSERT INTO `chats` (`id`, `name`, `type`, `school_id`, `is_pinned`, `created_by`, `created_at`, `updated_at`, `avatar_type`, `description`, `settings`, `last_message_id`, `last_message_at`, `is_encrypted`, `encryption_key`) VALUES
(302, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:36:10', '2026-04-25 11:36:10', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(303, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:36:11', '2026-04-25 11:36:11', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(304, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:36:11', '2026-04-25 11:36:11', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(305, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:36:13', '2026-04-25 11:36:13', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(306, 'Администрация школы', 'admin', 2, 1, NULL, '2026-04-25 11:36:14', '2026-04-25 11:36:14', 'default', 'Обращения к администрации школы', NULL, NULL, NULL, 0, NULL),
(307, 'Английский язык', 'subject', 2, 0, 6, '2026-04-25 11:54:54', '2026-04-25 11:54:54', 'default', '', NULL, NULL, NULL, 0, NULL),
(308, '2а', 'group', 2, 0, 6, '2026-04-25 12:18:38', '2026-04-25 12:18:38', 'default', 'чат класса', NULL, NULL, NULL, 0, NULL),
(313, '3d Класс ', 'class', 2, 0, 6, '2026-04-25 12:25:07', '2026-04-25 14:58:00', 'default', 'defdr', NULL, 32, '2026-04-25 14:58:00', 0, NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `chat_participants`
--

CREATE TABLE `chat_participants` (
  `id` int NOT NULL,
  `chat_id` int NOT NULL,
  `user_id` int NOT NULL,
  `role` enum('owner','admin','member') CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT 'member',
  `joined_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `left_at` datetime DEFAULT NULL,
  `is_active` tinyint(1) DEFAULT '1',
  `last_read_message_id` bigint DEFAULT NULL,
  `last_read_at` timestamp NULL DEFAULT NULL,
  `is_muted` tinyint(1) DEFAULT '0',
  `is_pinned` tinyint(1) DEFAULT '0',
  `notification_level` enum('all','mentions','none') CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT 'all',
  `custom_nickname` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `chat_participants`
--

INSERT INTO `chat_participants` (`id`, `chat_id`, `user_id`, `role`, `joined_at`, `left_at`, `is_active`, `last_read_message_id`, `last_read_at`, `is_muted`, `is_pinned`, `notification_level`, `custom_nickname`) VALUES
(6, 1, 2, 'member', '2026-04-25 10:00:00', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(7, 1, 3, 'member', '2026-04-25 10:00:00', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(8, 2, 3, 'owner', '2026-04-25 10:00:00', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(9, 2, 4, 'member', '2026-04-25 10:00:00', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(10, 3, 6, 'owner', '2026-04-25 10:20:52', NULL, 1, 15, '2026-04-25 11:35:41', 0, 0, 'all', NULL),
(79, 9, 6, 'member', '2026-04-25 11:04:53', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(80, 9, 8, 'member', '2026-04-25 11:04:53', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(87, 12, 6, 'member', '2026-04-25 11:04:57', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(88, 12, 7, 'member', '2026-04-25 11:04:57', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(92, 14, 6, 'member', '2026-04-25 11:04:58', NULL, 1, 16, '2026-04-25 11:35:00', 0, 0, 'all', NULL),
(93, 14, 9, 'member', '2026-04-25 11:04:58', NULL, 1, 16, '2026-04-25 11:36:09', 0, 0, 'all', NULL),
(226, 59, 9, 'member', '2026-04-25 11:08:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(227, 59, 8, 'member', '2026-04-25 11:08:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(258, 70, 9, 'member', '2026-04-25 11:08:08', NULL, 1, 21, '2026-04-25 11:36:11', 0, 0, 'all', NULL),
(259, 70, 7, 'member', '2026-04-25 11:08:08', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(488, 141, 1, 'owner', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(489, 142, 1, 'owner', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(490, 142, 5, 'member', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(491, 143, 2, 'owner', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(492, 144, 2, 'owner', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(493, 144, 5, 'member', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(494, 145, 3, 'owner', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(495, 146, 3, 'owner', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(496, 146, 5, 'member', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(497, 147, 4, 'owner', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(498, 148, 4, 'owner', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(499, 148, 5, 'member', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(500, 149, 5, 'owner', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(501, 150, 5, 'owner', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(503, 151, 6, 'owner', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(504, 152, 6, 'owner', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(505, 152, 5, 'member', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(506, 153, 7, 'owner', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(507, 154, 7, 'owner', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(508, 154, 5, 'member', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(509, 155, 8, 'owner', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(510, 156, 8, 'owner', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(511, 156, 5, 'member', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(512, 157, 9, 'owner', '2026-04-25 11:21:02', NULL, 1, 19, '2026-04-25 11:36:04', 0, 0, 'all', NULL),
(513, 158, 9, 'owner', '2026-04-25 11:21:02', NULL, 1, 20, '2026-04-25 11:36:06', 0, 0, 'all', NULL),
(514, 158, 5, 'member', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(515, 159, 2, 'admin', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(516, 159, 3, 'member', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(517, 159, 4, 'member', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(518, 160, 6, 'admin', '2026-04-25 11:21:02', NULL, 1, 18, '2026-04-25 11:35:50', 0, 0, 'all', NULL),
(519, 160, 7, 'member', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(520, 160, 8, 'member', '2026-04-25 11:21:02', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(521, 160, 9, 'member', '2026-04-25 11:21:02', NULL, 1, 22, '2026-04-25 11:36:00', 0, 0, 'all', NULL),
(963, 307, 6, 'owner', '2026-04-25 11:54:54', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(964, 3, 9, 'member', '2026-04-25 12:07:46', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(965, 308, 6, 'owner', '2026-04-25 12:18:38', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(966, 308, 7, 'admin', '2026-04-25 12:18:38', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(967, 308, 9, 'member', '2026-04-25 12:18:38', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(968, 308, 8, 'member', '2026-04-25 12:18:38', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(969, 313, 6, 'owner', '2026-04-25 12:25:07', NULL, 1, NULL, NULL, 0, 0, 'all', NULL),
(970, 313, 9, 'admin', '2026-04-25 12:25:07', NULL, 1, NULL, NULL, 0, 0, 'all', NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `classes`
--

CREATE TABLE `classes` (
  `id` int NOT NULL,
  `school_id` int NOT NULL,
  `name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `grade` int NOT NULL,
  `letter` char(5) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `teacher_id` int DEFAULT NULL,
  `is_active` tinyint(1) DEFAULT '1',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `academic_year` year DEFAULT (year(curdate())),
  `is_graduated` tinyint(1) DEFAULT '0',
  `graduation_year` year DEFAULT NULL,
  `room_number` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `chat_id` int DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `classes`
--

INSERT INTO `classes` (`id`, `school_id`, `name`, `grade`, `letter`, `teacher_id`, `is_active`, `created_at`, `description`, `academic_year`, `is_graduated`, `graduation_year`, `room_number`, `chat_id`) VALUES
(1, 1, '1А', 1, 'А', 3, 1, '2026-04-25 10:00:00', 'Первый класс', '2026', 0, NULL, '101', NULL),
(2, 2, '', 1, 'а', 7, 1, '2026-04-25 10:20:30', NULL, '2026', 0, NULL, '12', NULL),
(7, 2, 'Колчин Владислав Сергеевич', 3, 'd', 9, 1, '2026-04-25 12:25:07', NULL, '2026', 0, NULL, '23', 313);

-- --------------------------------------------------------

--
-- Структура таблицы `class_subjects`
--

CREATE TABLE `class_subjects` (
  `id` int NOT NULL,
  `class_id` int NOT NULL,
  `subject_id` int NOT NULL,
  `teacher_id` int DEFAULT NULL,
  `hours_per_week` int DEFAULT '0',
  `is_active` tinyint(1) DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `class_subjects`
--

INSERT INTO `class_subjects` (`id`, `class_id`, `subject_id`, `teacher_id`, `hours_per_week`, `is_active`) VALUES
(1, 1, 1, 3, 4, 1),
(2, 1, 2, 3, 5, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `favorite_messages`
--

CREATE TABLE `favorite_messages` (
  `id` int NOT NULL,
  `user_id` int NOT NULL,
  `message_id` bigint NOT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `invitation_codes`
--

CREATE TABLE `invitation_codes` (
  `id` int NOT NULL,
  `code` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `app_id` int NOT NULL DEFAULT '5',
  `app_code` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '725821',
  `school_id` int DEFAULT NULL,
  `class_id` int DEFAULT NULL,
  `user_type` enum('teacher','student','parent') CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_by` int DEFAULT NULL,
  `max_uses` int DEFAULT '1',
  `used_count` int DEFAULT '0',
  `is_active` tinyint(1) DEFAULT '1',
  `expires_at` datetime DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `invitation_codes`
--

INSERT INTO `invitation_codes` (`id`, `code`, `app_id`, `app_code`, `school_id`, `class_id`, `user_type`, `created_by`, `max_uses`, `used_count`, `is_active`, `expires_at`, `created_at`) VALUES
(1, 'DEMO2026', 5, '725821', 1, NULL, 'teacher', 1, 100, 0, 1, NULL, '2026-04-25 10:00:00'),
(2, 'INV2C164B3B', 5, '725821', 2, 2, 'teacher', 6, 1, 1, 1, '2026-05-25 13:23:01', '2026-04-25 10:23:01');

-- --------------------------------------------------------

--
-- Структура таблицы `messages`
--

CREATE TABLE `messages` (
  `id` bigint NOT NULL,
  `chat_id` int NOT NULL,
  `sender_id` int DEFAULT NULL,
  `message_text` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `message_type` enum('text','system','file','image','video') CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT 'text',
  `file_path` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `file_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `file_size` bigint DEFAULT NULL,
  `file_mime_type` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `is_edited` tinyint(1) DEFAULT '0',
  `edited_at` timestamp NULL DEFAULT NULL,
  `is_deleted` tinyint(1) DEFAULT '0',
  `deleted_at` timestamp NULL DEFAULT NULL,
  `replied_to` bigint DEFAULT NULL,
  `forwarded_from` bigint DEFAULT NULL,
  `is_system` tinyint(1) DEFAULT '0',
  `system_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `system_sender` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `sender_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `is_encrypted` tinyint(1) DEFAULT '0',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `messages`
--

INSERT INTO `messages` (`id`, `chat_id`, `sender_id`, `message_text`, `message_type`, `file_path`, `file_name`, `file_size`, `file_mime_type`, `is_edited`, `edited_at`, `is_deleted`, `deleted_at`, `replied_to`, `forwarded_from`, `is_system`, `system_type`, `system_sender`, `sender_name`, `is_encrypted`, `created_at`, `updated_at`) VALUES
(6, 3, 6, 'nCBREJ0P0fH+8snAoYW/4ww7ybExHnrTbhXSWV/u6iJt24qrP3o=', 'text', NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, 'Колчин Владислав Сергеевич', 1, '2026-04-25 10:21:10', '2026-04-25 10:21:10'),
(10, 3, 6, 'psqP3th2J4EzzkR4AaU0Z26ERUOpWQmBPL93rGDsoHOWPlfmvVgptE144VU4JZc=', 'text', NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, 'Колчин Владислав Сергеевич', 1, '2026-04-25 10:37:55', '2026-04-25 10:37:55'),
(11, 3, 6, 'Tx1M0f6MwpJci+96ExL2N7pcD4sPW0YZ7/ImPUak3kg1bxzqWF6kaHowccbaJWUbQTDp33aGvQKcr7kr+4sPvNdKgM2tA+ev', 'text', NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, 'Колчин Владислав Сергеевич', 1, '2026-04-25 10:39:11', '2026-04-25 10:39:11'),
(12, 3, 6, '', 'file', '/assets/uploads/files/69ec99e1cf757_T_E_Kh_N_I_Ch_E_S_K_O_E_Z_A_D_A_N_I_E.docx', 'T_E_Kh_N_I_Ch_E_S_K_O_E_Z_A_D_A_N_I_E.docx', 13139, 'application/vnd.openxmlformats-officedocument.wordprocessingml.document', 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, 'Колчин Владислав Сергеевич', 1, '2026-04-25 10:39:29', '2026-04-25 10:39:29'),
(15, 3, 6, 'tyytyyt', 'text', NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, 'Колчин Владислав Сергеевич', 0, '2026-04-25 11:12:02', '2026-04-25 11:12:02'),
(16, 14, 6, 'tr45t45tf45trf45tfg', 'text', NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, 'Колчин Владислав Сергеевич', 0, '2026-04-25 11:13:41', '2026-04-25 11:13:41'),
(18, 160, 9, 'trgftgftgr', 'text', NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, 'Кузнецова Айлин Николаевна', 0, '2026-04-25 11:22:31', '2026-04-25 11:22:31'),
(19, 157, 9, 't5rgt5rgt', 'text', NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, 'Кузнецова Айлин Николаевна', 0, '2026-04-25 11:22:35', '2026-04-25 11:22:35'),
(20, 158, 9, 'g5trgt5g5t', 'text', NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, 'Кузнецова Айлин Николаевна', 0, '2026-04-25 11:22:39', '2026-04-25 11:22:39'),
(21, 70, 9, '5tgtgttgytg', 'text', NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, 'Кузнецова Айлин Николаевна', 0, '2026-04-25 11:22:46', '2026-04-25 11:22:46'),
(22, 160, 6, 'ыцйцувувку', 'text', NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, 'Колчин Владислав Сергеевич', 0, '2026-04-25 11:35:52', '2026-04-25 11:35:52'),
(23, 160, 6, 'test', 'text', NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, 'Колчин Владислав Сергеевич', 0, '2026-04-25 11:41:46', '2026-04-25 11:41:46'),
(24, 152, 6, 'f4efr45trt4tr4f5grt45ftr4gf5', 'text', NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, 'Колчин Владислав Сергеевич', 0, '2026-04-25 11:43:25', '2026-04-25 11:43:25'),
(25, 151, 6, 'gt5r4frt45gftrg54frt4f5rt4feg', 'text', NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, 'Колчин Владислав Сергеевич', 0, '2026-04-25 11:43:29', '2026-04-25 11:43:29'),
(26, 160, 6, '12', 'text', NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, 'Колчин Владислав Сергеевич', 0, '2026-04-25 11:43:32', '2026-04-25 11:43:32'),
(27, 152, 6, '34', 'text', NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, 'Колчин Владислав Сергеевич', 0, '2026-04-25 11:44:04', '2026-04-25 11:44:04'),
(28, 151, 6, '34', 'text', NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, 'Колчин Владислав Сергеевич', 0, '2026-04-25 11:44:07', '2026-04-25 11:44:07'),
(29, 160, 6, '34', 'text', NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, 'Колчин Владислав Сергеевич', 0, '2026-04-25 11:44:10', '2026-04-25 11:44:10'),
(30, 3, 6, 'Колчин Владислав Сергеевич добавил(а) Кузнецова Айлин Николаевна', 'system', NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, NULL, NULL, 1, 'user_added', NULL, 'Колчин Владислав Сергеевич', 0, '2026-04-25 12:07:46', '2026-04-25 12:07:46'),
(31, 3, 9, 'привет', 'text', NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, 'Кузнецова Айлин Николаевна', 0, '2026-04-25 12:10:52', '2026-04-25 12:10:52'),
(32, 313, 9, 'пкекупаекп', 'text', NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, NULL, NULL, 0, NULL, NULL, 'Кузнецова Айлин Николаевна', 0, '2026-04-25 14:58:00', '2026-04-25 14:58:00');

-- --------------------------------------------------------

--
-- Структура таблицы `message_reactions`
--

CREATE TABLE `message_reactions` (
  `id` int NOT NULL,
  `message_id` bigint NOT NULL,
  `user_id` int NOT NULL,
  `reaction` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `message_read_status`
--

CREATE TABLE `message_read_status` (
  `id` int NOT NULL,
  `message_id` bigint NOT NULL,
  `user_id` int NOT NULL,
  `read_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `message_read_status`
--

INSERT INTO `message_read_status` (`id`, `message_id`, `user_id`, `read_at`, `created_at`) VALUES
(277, 6, 6, '2026-04-25 10:21:13', '2026-04-25 10:21:13'),
(315, 10, 6, '2026-04-25 10:38:06', '2026-04-25 10:38:06'),
(327, 11, 6, '2026-04-25 10:39:17', '2026-04-25 10:39:17'),
(332, 12, 6, '2026-04-25 10:42:08', '2026-04-25 10:42:08'),
(689, 16, 6, '2026-04-25 11:13:45', '2026-04-25 11:13:45'),
(694, 15, 6, '2026-04-25 11:13:49', '2026-04-25 11:13:49'),
(749, 18, 6, '2026-04-25 11:23:05', '2026-04-25 11:23:05'),
(757, 18, 9, '2026-04-25 11:25:53', '2026-04-25 11:25:53'),
(758, 19, 9, '2026-04-25 11:25:53', '2026-04-25 11:25:53'),
(759, 20, 9, '2026-04-25 11:25:54', '2026-04-25 11:25:54'),
(760, 21, 9, '2026-04-25 11:25:59', '2026-04-25 11:25:59'),
(772, 16, 9, '2026-04-25 11:30:03', '2026-04-25 11:30:03'),
(819, 22, 9, '2026-04-25 11:36:00', '2026-04-25 11:36:00'),
(831, 22, 6, '2026-04-25 11:41:38', '2026-04-25 11:41:38'),
(835, 23, 6, '2026-04-25 11:42:05', '2026-04-25 11:42:05'),
(853, 25, 6, '2026-04-25 11:43:57', '2026-04-25 11:43:57'),
(854, 24, 6, '2026-04-25 11:43:58', '2026-04-25 11:43:58'),
(860, 26, 6, '2026-04-25 11:44:08', '2026-04-25 11:44:08'),
(899, 29, 6, '2026-04-25 11:50:57', '2026-04-25 11:50:57'),
(901, 28, 6, '2026-04-25 11:50:58', '2026-04-25 11:50:58'),
(925, 27, 6, '2026-04-25 11:53:14', '2026-04-25 11:53:14'),
(1001, 30, 6, '2026-04-25 12:08:04', '2026-04-25 12:08:04'),
(1005, 6, 9, '2026-04-25 12:10:31', '2026-04-25 12:10:31'),
(1006, 10, 9, '2026-04-25 12:10:31', '2026-04-25 12:10:31'),
(1007, 11, 9, '2026-04-25 12:10:31', '2026-04-25 12:10:31'),
(1008, 12, 9, '2026-04-25 12:10:31', '2026-04-25 12:10:31'),
(1009, 15, 9, '2026-04-25 12:10:31', '2026-04-25 12:10:31'),
(1010, 30, 9, '2026-04-25 12:10:31', '2026-04-25 12:10:31'),
(1017, 31, 6, '2026-04-25 12:11:17', '2026-04-25 12:11:17'),
(1024, 31, 9, '2026-04-25 14:57:53', '2026-04-25 14:57:53'),
(1039, 32, 9, '2026-04-25 14:58:03', '2026-04-25 14:58:03');

-- --------------------------------------------------------

--
-- Структура таблицы `message_reports`
--

CREATE TABLE `message_reports` (
  `id` int NOT NULL,
  `message_id` bigint NOT NULL,
  `reported_by` int NOT NULL,
  `reason` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `status` enum('pending','reviewed','resolved','dismissed') CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT 'pending',
  `reviewed_by` int DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `schools`
--

CREATE TABLE `schools` (
  `id` int NOT NULL,
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `number` int NOT NULL,
  `address` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `email` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `is_active` tinyint(1) DEFAULT '1',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `schools`
--

INSERT INTO `schools` (`id`, `name`, `number`, `address`, `phone`, `email`, `is_active`, `created_at`, `updated_at`) VALUES
(1, 'Демо-школа №1', 1, 'ул. Примерная, д. 1', '+7 (999) 123-45-67', 'school1@example.com', 1, '2026-04-25 10:00:00', '2026-04-25 10:21:57'),
(2, 'МОУ \"СОШ №3\"', 31, 'тест', '+79087193593', 'colchin.vl4d@yandex.ru', 1, '2026-04-25 10:03:18', '2026-04-25 10:21:53');

-- --------------------------------------------------------

--
-- Структура таблицы `school_statistics`
--

CREATE TABLE `school_statistics` (
  `id` int NOT NULL,
  `school_id` int NOT NULL,
  `date` date NOT NULL,
  `active_teachers` int DEFAULT '0',
  `active_students` int DEFAULT '0',
  `active_parents` int DEFAULT '0',
  `total_messages` int DEFAULT '0',
  `new_users_today` int DEFAULT '0',
  `active_chats` int DEFAULT '0',
  `new_chats_today` int DEFAULT '0',
  `avg_session_minutes` decimal(5,2) DEFAULT '0.00',
  `peak_hour` time DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `security_logs`
--

CREATE TABLE `security_logs` (
  `id` int NOT NULL,
  `user_id` int DEFAULT NULL,
  `event_type` enum('login_success','login_failed','logout','password_change','account_locked','message_reported','user_blocked') CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `ip_address` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `user_agent` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `details` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `security_logs`
--

INSERT INTO `security_logs` (`id`, `user_id`, `event_type`, `ip_address`, `user_agent`, `details`, `created_at`) VALUES
(1, 1, 'login_failed', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Failed login attempt for superadmin@mtsoc.ru', '2026-04-25 09:45:30'),
(2, 1, 'login_failed', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Failed login attempt for superadmin@mtsoc.ru', '2026-04-25 09:48:43'),
(3, 1, 'login_failed', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Failed login attempt for superadmin@mtsoc.ru', '2026-04-25 09:50:09'),
(4, 1, 'login_failed', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Failed login attempt - wrong password for superadmin@mtsoc.ru', '2026-04-25 09:51:55'),
(5, 1, 'login_failed', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Failed login attempt - wrong password for superadmin@mtsoc.ru', '2026-04-25 09:53:13'),
(6, 1, 'login_failed', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Failed login attempt - wrong password for superadmin@mtsoc.ru', '2026-04-25 09:53:16'),
(7, 1, 'login_failed', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Failed login attempt - wrong password for superadmin@mtsoc.ru', '2026-04-25 09:53:27'),
(8, 1, 'login_failed', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Failed login - wrong password for superadmin@mtsoc.ru', '2026-04-25 09:53:52'),
(9, 1, 'login_failed', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Failed login - wrong password for superadmin@mtsoc.ru', '2026-04-25 09:54:35'),
(10, 1, 'login_failed', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Wrong password for superadmin@mtsoc.ru', '2026-04-25 09:57:52'),
(11, 1, 'login_failed', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Wrong password for superadmin@mtsoc.ru', '2026-04-25 10:00:01'),
(12, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:00:19'),
(13, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:01:43'),
(14, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:02:42'),
(15, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:03:40'),
(16, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:03:45'),
(17, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:15:14'),
(18, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:15:17'),
(19, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:15:27'),
(20, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:15:31'),
(21, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:16:02'),
(22, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:16:05'),
(23, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:19:38'),
(24, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:19:42'),
(25, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:19:46'),
(26, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:19:50'),
(27, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:21:20'),
(28, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:21:46'),
(29, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:22:02'),
(30, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:22:06'),
(31, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:22:12'),
(32, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:22:19'),
(33, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:25:57'),
(34, 9, 'login_success', '127.0.0.1', NULL, 'Registration via invitation code INV2C164B3B', '2026-04-25 10:26:13'),
(35, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:26:29'),
(36, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:26:32'),
(37, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:26:54'),
(38, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:26:57'),
(39, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:27:02'),
(40, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:27:13'),
(41, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Linux; Android 6.0; Nexus 5 Build/MRA58N) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 Mobile Safari/537.36', 'User logged out', '2026-04-25 10:28:47'),
(42, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Linux; Android 6.0; Nexus 5 Build/MRA58N) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 Mobile Safari/537.36', 'Successful login', '2026-04-25 10:28:50'),
(43, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Linux; Android 6.0; Nexus 5 Build/MRA58N) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 Mobile Safari/537.36', 'User logged out', '2026-04-25 10:30:02'),
(44, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:33:12'),
(45, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:33:17'),
(46, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:33:28'),
(47, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:33:34'),
(48, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:33:38'),
(49, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:38:28'),
(50, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:38:34'),
(51, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:38:41'),
(52, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:38:44'),
(53, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:38:49'),
(54, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:38:53'),
(55, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:40:40'),
(56, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:40:42'),
(57, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:41:40'),
(58, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:41:40'),
(59, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:41:56'),
(60, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:42:00'),
(61, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:42:04'),
(62, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:56:26'),
(63, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:56:28'),
(64, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:56:41'),
(65, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:56:44'),
(66, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 10:57:34'),
(67, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 10:57:38'),
(68, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:06:52'),
(69, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:06:55'),
(70, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:09:48'),
(71, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:09:50'),
(72, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:09:57'),
(73, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:10:02'),
(74, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:12:17'),
(75, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:12:20'),
(76, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:12:26'),
(77, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:13:24'),
(78, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:13:30'),
(79, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:13:34'),
(80, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:16:25'),
(81, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:16:27'),
(82, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:17:25'),
(83, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:17:29'),
(84, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:19:25'),
(85, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:21:16'),
(86, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:22:49'),
(87, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:22:51'),
(88, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:22:58'),
(89, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:23:03'),
(90, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:23:31'),
(91, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:25:51'),
(92, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:26:01'),
(93, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:26:03'),
(94, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:26:08'),
(95, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:26:13'),
(96, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:26:45'),
(97, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:26:47'),
(98, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:26:53'),
(99, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:26:59'),
(100, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:29:56'),
(101, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:29:59'),
(102, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:30:13'),
(103, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:30:22'),
(104, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:30:27'),
(105, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:30:31'),
(106, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:35:56'),
(107, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:35:58'),
(108, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:41:22'),
(109, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:41:25'),
(110, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:41:31'),
(111, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:41:37'),
(112, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:41:51'),
(113, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:41:54'),
(114, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:42:00'),
(115, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:42:04'),
(116, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:43:38'),
(117, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:43:41'),
(118, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:43:52'),
(119, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:43:56'),
(120, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:44:15'),
(121, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:44:17'),
(122, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:44:22'),
(123, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:44:27'),
(124, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:49:32'),
(125, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:49:36'),
(126, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:49:54'),
(127, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:49:56'),
(128, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:50:02'),
(129, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:50:08'),
(130, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:55:33'),
(131, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:55:36'),
(132, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 11:55:40'),
(133, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 11:55:45'),
(134, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 12:10:21'),
(135, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 12:10:24'),
(136, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 12:10:55'),
(137, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 12:10:58'),
(138, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 12:11:09'),
(139, 6, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 12:11:14'),
(140, 6, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 12:25:35'),
(141, 1, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 14:57:39'),
(142, 1, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 14:57:41'),
(143, 9, 'login_success', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Successful login', '2026-04-25 14:57:44'),
(144, 9, 'logout', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'User logged out', '2026-04-25 14:58:13');

-- --------------------------------------------------------

--
-- Структура таблицы `subjects`
--

CREATE TABLE `subjects` (
  `id` int NOT NULL,
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `school_id` int NOT NULL,
  `is_active` tinyint(1) DEFAULT '1',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `subjects`
--

INSERT INTO `subjects` (`id`, `name`, `description`, `school_id`, `is_active`, `created_at`) VALUES
(1, 'Математика', 'Алгебра и геометрия', 1, 1, '2026-04-25 10:00:00'),
(2, 'Русский язык', 'Грамматика и литература', 1, 1, '2026-04-25 10:00:00'),
(3, 'Информатика', 'Основы программирования', 1, 1, '2026-04-25 10:00:00');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int NOT NULL,
  `email` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `password_hash` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `role` enum('super_admin','admin','teacher','student','support') CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'teacher',
  `school_id` int DEFAULT NULL,
  `class_id` int DEFAULT NULL,
  `parent_id` int DEFAULT NULL,
  `min_id` int NOT NULL DEFAULT '1',
  `avatar_type` enum('default','custom') CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT 'default',
  `avatar_url` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `is_active` tinyint(1) DEFAULT '1',
  `last_seen` datetime DEFAULT NULL,
  `is_online` tinyint(1) DEFAULT '0',
  `privacy_last_seen` enum('all','contacts','nobody') CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT 'all',
  `privacy_messages` enum('all','contacts','nobody') CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT 'all',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `email`, `password_hash`, `name`, `role`, `school_id`, `class_id`, `parent_id`, `min_id`, `avatar_type`, `avatar_url`, `is_active`, `last_seen`, `is_online`, `privacy_last_seen`, `privacy_messages`, `created_at`, `updated_at`) VALUES
(1, 'superadmin@mtsoc.ru', '$2y$10$4JTY4iWnrys/PAO.iIaPgODivLdCLZI1lF1UrmzbDH/7sDYVOSo.q', 'Супер Администратор', 'super_admin', NULL, NULL, NULL, 1, 'default', NULL, 1, '2026-04-25 17:57:41', 0, 'all', 'all', '2026-04-25 10:00:00', '2026-04-25 14:57:41'),
(2, 'admin@school1.ru', '$2y$10$VQJqD5lGm0B3hK8xR7tZwOzMqLqNaYq9YpXVmC4wX8vR5sT6uH7e', 'Администратор Школы', 'admin', 1, NULL, NULL, 1, 'default', NULL, 1, NULL, 0, 'all', 'all', '2026-04-25 10:00:00', '2026-04-25 10:00:00'),
(3, 'teacher1@school1.ru', '$2y$10$VQJqD5lGm0B3hK8xR7tZwOzMqLqNaYq9YpXVmC4wX8vR5sT6uH7e', 'Иванов Иван Иванович', 'teacher', 1, NULL, NULL, 1, 'default', NULL, 1, NULL, 0, 'all', 'all', '2026-04-25 10:00:00', '2026-04-25 10:00:00'),
(4, 'student1@school1.ru', '$2y$10$VQJqD5lGm0B3hK8xR7tZwOzMqLqNaYq9YpXVmC4wX8vR5sT6uH7e', 'Петров Петр Петрович', 'student', 1, 1, NULL, 1, 'default', NULL, 1, NULL, 0, 'all', 'all', '2026-04-25 10:00:00', '2026-04-25 10:00:00'),
(5, 'support@mtsoc.ru', '$2y$10$VQJqD5lGm0B3hK8xR7tZwOzMqLqNaYq9YpXVmC4wX8vR5sT6uH7e', 'Служба Поддержки', 'support', NULL, NULL, NULL, 1, 'default', NULL, 1, NULL, 0, 'all', 'all', '2026-04-25 10:00:00', '2026-04-25 10:00:00'),
(6, 'colchin.vl4d@yandex.ru', '$2y$10$KWT8wZlQ1ZZhe.mCxlYFneIygXG.2SchPvnsYZo8IGD5JtyFDBBcq', 'Колчин Владислав Сергеевич', 'admin', 2, NULL, NULL, 1, 'default', NULL, 1, '2026-04-25 15:25:35', 0, 'all', 'all', '2026-04-25 10:03:37', '2026-04-25 12:25:35'),
(7, 'colchin.vl412d@yandex.ru', '$2y$10$4t.EBLSO.ZQ4kp086.ulauapWum7fp0eE4yHO1KGBypCkgfiPY5sO', 'Колчин Владислав Сергеевич', 'teacher', 2, NULL, NULL, 1, 'default', NULL, 1, NULL, 0, 'all', 'all', '2026-04-25 10:20:11', '2026-04-25 10:27:33'),
(8, 'user3@ex.ru', '$2y$10$2vbPM9v9uWoBBFfKLON5NePlyK7dODh1sZd0N2Z6cHCAmqE8NfQre', 'Миронов Егор Миронович', 'student', 2, 2, NULL, 1, 'default', NULL, 1, NULL, 0, 'all', 'all', '2026-04-25 10:20:44', '2026-04-25 10:27:29'),
(9, 'user12@ex.ru', '$2y$10$jbtVgzFJQAq.h2absVTw0uQbzq9hozTtQvzNgRGVPXpuVJlzduWhy', 'Кузнецова Айлин Николаевна', 'teacher', 2, 2, NULL, 1, 'default', NULL, 1, '2026-04-25 17:58:13', 0, 'all', 'all', '2026-04-25 10:26:13', '2026-04-25 14:58:13');

-- --------------------------------------------------------

--
-- Структура таблицы `user_sessions`
--

CREATE TABLE `user_sessions` (
  `id` varchar(128) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_id` int NOT NULL,
  `token` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `ip_address` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_agent` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `device_info` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `is_active` tinyint(1) DEFAULT '1',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `last_activity` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `expires_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `user_sessions`
--

INSERT INTO `user_sessions` (`id`, `user_id`, `token`, `ip_address`, `user_agent`, `device_info`, `is_active`, `created_at`, `last_activity`, `expires_at`) VALUES
('05a0bd61c9e69b83d07e80ec044a0cf8', 1, 'f0b37d7c857a525fb21a3bca2da4c9923501cbac13ad8eb578fc386ac7bf65be1bbb3253795eb341b46a5816a5ca8247a5fae3a80ede9e5f43b16bdece37fc3f', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 14:57:39', '2026-04-25 14:57:39', '2026-05-02 17:57:39'),
('0cd463333c9a517326be1fb88063b5c6', 9, '915d95fcbd12df262c2234170619e6e9ac7bb433b95ab819fbf88fbf355591a97f42407eb9611270f0202fea7d4115a7681c210ac9f3cffe3389a2020973bede', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:40:42', '2026-04-25 10:40:42', '2026-05-02 13:40:42'),
('10787419ba3974f972818d4818b405fb', 6, '5a20e5453f437b4625328665d1c4a8ad1abda17bcbab9afae2a955fe339f9136841d7f0dc349dbb86d2e8a65406c3d1aa7dc51c6f5aa06309703580d82354cab', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 12:11:14', '2026-04-25 12:11:14', '2026-05-02 15:11:14'),
('1079d20533df0e66a756a7aaeba8504d', 6, '31448eb4a715b1d67c5ac07fbe6e6440270f9cc7b3a82f040c37078f1ec92ae474eb33f22d470b21ae99a7c56baf4052bf2fac0058feccea8a56230a82162f8e', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:22:19', '2026-04-25 10:22:19', '2026-05-02 13:22:19'),
('187a206bb1089feca4e29e4ecc292ae7', 6, '3df4729d15403f090e455deca48a6c3bd788f6e9a077e5990c3fead062aac2d57313ed4b9ee8d00c0024240599ef5ff266ce99beeb9a5f3bcd1a370b786083da', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:10:02', '2026-04-25 11:10:02', '2026-05-02 14:10:02'),
('1e405a5508ba16f660cdddbdf5a56b66', 9, 'd0e0ae8d70cbf2ae27263462232d2f1f6475e462d1dc3dfc90a8943308179e93187f2d2d52586f54e27fc596b3e0aea8bb47dad960182fc2fc7f5e6c27b4b298', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:41:54', '2026-04-25 11:41:54', '2026-05-02 14:41:54'),
('2115e6297ef2defc99ecb862be093635', 1, '61a60b229049a494059b1dd22475b3382734f0ba48626fc47b42349cbfafeb8b0d24d45ee5a658123db122127003d78de10b9b77026fdac533297242978c2f53', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:38:44', '2026-04-25 10:38:44', '2026-05-02 13:38:44'),
('23bbdc29fda9fb325f8c12619111a57c', 1, '3125adc4fea32f932b68964d8736d1c70de070db43eeead16301f0944bff6a971d3e4732dc75cf1ddbe9f1cca41e9d05ce55ff7ec83001ac52889eb6b1e7a741', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:33:28', '2026-04-25 10:33:28', '2026-05-02 13:33:28'),
('27c4f06c6414e894b12ceb7b28d22236', 9, '9613f8527cc09ceafc20a4d2ca00de551e330cfd73d9bceb9b6ca8380da0b9fb99b701c5fed4b011f9a4a0943e69eae6c7f37c3cf0fd3712fed80eae2fc01265', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:49:36', '2026-04-25 11:49:36', '2026-05-02 14:49:36'),
('29b2b7e95b2e5e992a061e3ce50da1e4', 6, 'c769927862f2a925e7e17434797e2d80247b89e31b15b2046448057f0bfc1665a4660c90b695d4117fcb20a33c966374160a7853a4615603c884a0fe2c4434b5', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:42:04', '2026-04-25 11:42:04', '2026-05-02 14:42:04'),
('2fd8d04ab732702daedeb13a0d20dd89', 9, '6fbedd162bdac06d928ddcbc2a8fbd988e5590e0adaec7201225f68891ae6c0341d61d942a37108c12f5a9628460e1006cad3265657c687c9698db138eb245e3', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:25:50', '2026-04-25 11:25:50', '2026-05-02 14:25:50'),
('3272a99a20bb26814d8f1d9a59735d32', 6, '5368860ca87e9d188fa9a2233fde5c651fd9117280145a4351552df2727f8f2308a96542857b4b621ce0ffe31293d49e7c8c017898b2dfe0337f1844b1a7b3ee', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:30:31', '2026-04-25 11:30:31', '2026-05-02 14:30:31'),
('36265f54e0964b4b1cd5fa0b926d752f', 9, 'a52776033f0848a52514c6b3b90ee2234376ad172d189788d1d010ccceb5cefbd37038d2b186773be403c250df50781d94189df2084665b018f7b946ae721507', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:06:55', '2026-04-25 11:06:55', '2026-05-02 14:06:55'),
('37cc9f01f399f7a4d7d2cd4bff5cda88', 1, '60e0036de8df8fd963430f73c063407a7ce5a0c700107471b07c06b8840b6c6eae677875ed4e9d87dee472efb5b6925ae3d4b03a7ccf352a65868fee5e6795a9', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:22:51', '2026-04-25 11:22:51', '2026-05-02 14:22:51'),
('3c36e6f55f92e40a3909d469e6859163', 6, '264534b5488e425ab0402fcc6f200282276c068feff7b24710684e8957187a783c0afa5fc60d23e33321d4496d00683e4eb3149ab9a453b75e745fed29b552ed', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:26:13', '2026-04-25 11:26:13', '2026-05-02 14:26:13'),
('422cc325869023941ee2e5a24031b5bc', 1, '3ade8ecd96fc853737bb9cfe814c8564965eebd4ce9ac4673ae97f2ea442a0b79bf0cbdba3be6001bd13f7feaa327771f8aa7d95220fd957c37eff3f92a07c5f', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:22:06', '2026-04-25 10:22:06', '2026-05-02 13:22:06'),
('4243f67d0d08caa6af6e15764ea3bc77', 6, 'a93663fb17b3c36dc4a2b5a6a124d4583cf38267cb083ca0c724dcbd5d0bfb7a9505ac09018aa144ba057c4ece5f5075c78bfdf0a638bd545742646048b738ed', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:43:56', '2026-04-25 11:43:56', '2026-05-02 14:43:56'),
('4310c0d1ef6a13a31ee5288012ff0f73', 9, '6c31eca711e97b65f8fefc7c67d3db27df6a61ce1d03b753061ec060d0be416ac25585d640f20a555ad9f98ebb0e08616720c583d5455e2d276a883a0ac1f464', '127.0.0.1', 'Mozilla/5.0 (Linux; Android 6.0; Nexus 5 Build/MRA58N) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 Mobile Safari/537.36', 'Web Browser', 1, '2026-04-25 10:28:50', '2026-04-25 10:28:50', '2026-05-02 13:28:50'),
('4a547b1697edd4ae11dde170d4305813', 6, '1579f24cd1900f233aa395d1495543b3e7b296b08a1b3eeac9c42266f1b2e143a3cc149cc18eb7265b5f71c7f78d7637670c479edfa7be39bd66c390c155b01d', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:26:59', '2026-04-25 11:26:59', '2026-05-02 14:26:59'),
('4c53f166e63f5a0da29684a0a25a6cfb', 6, '95ce78133ea8cbfda0bc471430134a9f08681e102ec6117e7935d56048f0205d8f025dbd4f0f1cb2cad10c8d84e62fe1216cea6966a1eb2af25cb08c5fb27037', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:23:03', '2026-04-25 11:23:03', '2026-05-02 14:23:03'),
('4ee790efb287607ba3430774ba0b0813', 1, 'f90529f58c26b291514fbec3c1dd34679f4ba49c34cfeba09d65393e4308cdf55d5f50279561994b9d8403e5d9a7bd4f290928006abfc1e8fce7fedc595cdcd7', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:33:12', '2026-04-25 10:33:12', '2026-05-02 13:33:12'),
('4fbb021148c7c1dee219459959af7792', 9, 'a9e7612e1342caa7e67ba92683f8eaa324e6ac483dd9075fa5d4a6bf777ad3c4c0c23b07197faa3a24d214b1f76416ae4f75c7b8306549aa6f68757212d017c4', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:43:41', '2026-04-25 11:43:41', '2026-05-02 14:43:41'),
('4fd754f30eb928e8f4bc9f0d0fbc9462', 1, 'af42ee8233f6e4780f4d201165621837bd3a4f70c08606d066f94e45389f17f6deaa01e3402d5e463ae7da63f40fd1185f9c862bfe6f65875245a12ca7191308', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 12:10:58', '2026-04-25 12:10:58', '2026-05-02 15:10:58'),
('54f08cf6069b38a42441275737871b56', 1, 'ada8e0e68a3e1a72996385c09643ccedb24c70fe729623d843add781516d5a45d3d398f64f3d77cdbbbcc20f1823d934249514d27646500f6cad7bb96fc231e4', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:49:56', '2026-04-25 11:49:56', '2026-05-02 14:49:56'),
('5c4882e38f5603718584a554fe735375', 1, '841cc6c1b53bafe39430cd12a3a02bc1266506ca1b6f67f3206d1c159d8a4ae63aa7336ba76d988fa517f426ba71c7d72229df6f7a7b0107ed9176549f340a9c', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:09:50', '2026-04-25 11:09:50', '2026-05-02 14:09:50'),
('60591b3eaf1b7dbfb468fb160921a797', 9, 'd411fb7ed3e38336889a04c737e5a213382b697ae8940b0dbe39eecf6440f8f9186e1bf3a2f95254c2ee00d351405cd2f47a69e2bd721dbf7dd0a8c8ae049e3b', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:35:58', '2026-04-25 11:35:58', '2026-05-02 14:35:58'),
('620fd576ae825b4faa1d6789bc9a656c', 1, '8434a44b4d73209e935843e8e1308906ce9e593e9bf7cff2eb0c9fa611468c89867db967bde520d3b6c2f2e2ebd0b016b3f2424a85658d7c5e73cd3c5f735aa7', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:15:17', '2026-04-25 10:15:17', '2026-05-02 13:15:17'),
('66819d4ce874a6079008a97797c010fa', 9, '7766b1dc34dc9317fbdb2fa591bf3705b1cb297371d82f2e429ee5f95eec57f1998095a0e8c65b73c32bb8aa14f74ce9c2c8c5d36a6d439c55cbc7f3b03af5dc', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:26:32', '2026-04-25 10:26:32', '2026-05-02 13:26:32'),
('68e67111eb96070cb94bfc7f9a154752', 1, '1128123a6a09fef8aa70b5bece5c42cbcbf157c2cc9d1d86af9f8150f7f34ccc06c8f69dc0b8dd94baccfaec24b79613ad7b494f1d0b6cf4353fff17acf64318', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:26:57', '2026-04-25 10:26:57', '2026-05-02 13:26:57'),
('693339055b83ec5b6e9fdb3b0578031b', 1, '8c55e28948d716f6298183bdd3ae2c700f3ef2a2db455d1d50f593ac656300f616cd5ac4894329ff36367af71c32868c57d7d598f5c74314c91eed91ff6410de', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:41:56', '2026-04-25 10:41:56', '2026-05-02 13:41:56'),
('69c82d75f529d544e72b350139272d9b', 6, 'd269489d4163f2730d2832e79979bc6cd9239f6c796ad64f03ba38dbea5a5fbcf27c16d5cd4129dba0393a1a6dc1be62b29141a7f2d29c42c052344a1a3399ee', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:33:38', '2026-04-25 10:33:38', '2026-05-02 13:33:38'),
('79fe2564cafb0a7c18aad933d323047b', 9, '6bc96cba174cb7193a83d0bd0168abfb3925f2fe0ff4bc2a2ba065403d49e67b101e69832fde70597dde50964f170a80e6032c2d8e85ca1f59ef46a90cecc0db', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 14:57:44', '2026-04-25 14:57:44', '2026-05-02 17:57:44'),
('7ad1fff31f2da426c5d0c1fb483eeade', 1, '111187d700d16484bcc40370ed5317ec3ef03bc45dd3567d69798f7cb44e9f522a6e40bc50d175a4d3dcda49eb2b451b0e33dd7e3c6ffbda8c41bcc7f307ec8b', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:30:22', '2026-04-25 11:30:22', '2026-05-02 14:30:22'),
('7e37b02243e352159f16fc63cf475a3e', 1, '33def1e80568bd91e38083c619ac80f1e886da8038f509ca55ce5411da508999d4f993ba7d9e8bbb49c109b6ef4b6f9a98feaf756ea2f058ddc1e5dfda468a8c', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:41:25', '2026-04-25 11:41:25', '2026-05-02 14:41:25'),
('811f77eb1ec55dd98ddd2be9567bdc0a', 6, '352b7b3d59a33e9aa9358f5da7a1cc0c8c5657ccf7b6c7914b9f161dce474ade9c3624979314ddea2b673aaa32fac80b52fcfbf84eb5bae38c22ba70ec2731d3', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:27:13', '2026-04-25 10:27:13', '2026-05-02 13:27:13'),
('8a7db2498fd2264c9907f38a95692f6d', 6, '6ff14d7f0e7ade9b07fe79bea0f5d2acaffc82721da7d5b6dab05a8b4d19aa0c023f5b3ee0846ba209d9e94b76d7645a6bfa6c7aeb195dffb0508d49d7bd3c1d', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:13:34', '2026-04-25 11:13:34', '2026-05-02 14:13:34'),
('8f3be9c6e8fb80e1404de7f18b65c190', 9, '95ce66e66bd33af0a1444df070b32abca8ece071f7efd07a0abf380884101eb8ede2693c128f3f11d7b74e73ba39f2c2f96f29616447ec687b7d5b0cf9620035', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:16:27', '2026-04-25 11:16:27', '2026-05-02 14:16:27'),
('965933630de568cf79d0e2176f03dad2', 6, '2ddf7373a044ea59b535175f4fa460183dd9a974a8bc72b0ba2e87555dfb6e5455530a6e961c7fe3865e0795d283b89d1cc11d0a6cddbe57f5c3d8a3a3269949', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:38:53', '2026-04-25 10:38:53', '2026-05-02 13:38:53'),
('98571495eb558337d3953fd12df1ff9b', 6, 'ef7069f3b7f96fe096012dd358dcaf4bdc20f904b0ec1c64dda007946a6987293465d1242ddc040b1b04d522a6dafc1e30f0ee914b8b625f54a53d5caab51ba7', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:44:27', '2026-04-25 11:44:27', '2026-05-02 14:44:27'),
('a23c338b55a7767e0590dc73fa24b449', 1, '756d2e9f367d16b7c13e236129def3dc1a439967256d1570a4c7c48f034dd2cbfe4a1fd765470ded19a125cf702a1f76fcb7d0897e85a7927981ed23f0f7c13f', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:00:19', '2026-04-25 10:00:19', '2026-05-02 13:00:19'),
('a5cb6f53e6c59533e7e8e26be1477eb0', 9, '2c62a9fe74e61c63c37f6eca97b0442692413eddb35cab2a809b2801995fdc484b756fa35979b219d04f4ded204533d0b4a2854017b12d595dd7f8b1f128e324', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:44:17', '2026-04-25 11:44:17', '2026-05-02 14:44:17'),
('a765ecf217cec1d8ddd02e9c116780eb', 9, '1bb3a443421496f57e36183b9d788d0f46b94fb4ced5d599d632d01f607a5962b565aab11ca806434db34c8c80339a73b3457af1b6d4fd5c077478f3c50305e1', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:26:47', '2026-04-25 11:26:47', '2026-05-02 14:26:47'),
('ab4c033f2502f8ee54df1424aa0777a4', 6, 'a0e8b742258dda9a545ffa03a159b72a4507a28441b904f679bb151a1e318fd11af26d6e70ea8c21be5c16992cd602e24012231fe91dd0a1cb3308590a482ba9', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:57:38', '2026-04-25 10:57:38', '2026-05-02 13:57:38'),
('af56cd0671cf800f7ff92583ab0d03b2', 1, '2bc80fae1b0c1311b3a2170c8a51ad6303e17be256c95676093ee771189e79e2c274194a65c40b643cb1a9f9e9394c618e9f4ddcb6759cb1c5b57ec1c7bf6701', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:56:44', '2026-04-25 10:56:44', '2026-05-02 13:56:44'),
('b60fece7f5fb618b75674597a261e15f', 1, 'ba3073ca6d4821246c9bef6df6705e8765bfa875f12fc6127a3c40032aa98af7b6fffd70c23a3aa50c1d4198056ee00d9ae64efe5123ccceccadd70507c7d7da', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:16:05', '2026-04-25 10:16:05', '2026-05-02 13:16:05'),
('bb15e13e10b978a58f5e1eb76db14c46', 9, 'ad25ebed16bf328c69433a76e68b41ce6a1b7b1b5719ec53e0c0bb01ba8f2d7c483537ce91fbb0a7e7f0864111d0fa21baa8c3ec201f6b70e9945e243c7d356e', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:55:36', '2026-04-25 11:55:36', '2026-05-02 14:55:36'),
('bc52c5cdbe1937674c6a52533f09f3d4', 9, 'ccf111dd078a46b4a2a055fa91145e253960925c930e32aa769209931a8022bb25fad760f70c592af075e3ab452542c3e9ebe087e94590caa4328de25bb21e1d', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:29:59', '2026-04-25 11:29:59', '2026-05-02 14:29:59'),
('c3f85786e0779fd80b733cc065798dd2', 1, 'c604d6ecbedc8df5c65c20edcc5135e5dd10ac9c2abfdfa76c993b777f54a1aa69c809cc1980dec844725648cf3be4265e08b45426966192f19f8eef27d899bf', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:13:24', '2026-04-25 11:13:24', '2026-05-02 14:13:24'),
('c7f79a1cf787ecc541cfd1fa3a8892f8', 6, '449a4792db262968529e8d8be87b315f9faae5ac991271f35117a11a3e696478e4bcf2d2c0988d4d3d13c610dec33f69db61b2c9e72100c6cd0360830fb62520', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:42:04', '2026-04-25 10:42:04', '2026-05-02 13:42:04'),
('ce134fa9e3009af1e18ec42b43436420', 6, 'a23755624040afd74da0c64556747901f8ddc8ef8b120f05b2b1dec0e6bd7dec741b22eb4e1cc8ee5db32ac0953e7d57252ae46a6b6e8edc9f0487a2b8e5d03d', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:41:37', '2026-04-25 11:41:37', '2026-05-02 14:41:37'),
('d833128337980019f1bfd28c93b438da', 9, '1fb81a2191d59df9c5d1aff30a34ff29381a5f0eac213d4336ef95d968019b88a8e5dcca3da14104eee903c5a5b59ec66984b420783243b7890c17125696a546', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:21:16', '2026-04-25 11:21:16', '2026-05-02 14:21:16'),
('d86163be3477004c5879b408ff19c6b2', 1, '24684324efa5b1406a32ca82d04a24d6f3cd59f8c5526ac34a5a9ccdce24c3d440500f508a37b88600c8e888d5bf61ca956cac4bee9d8059c5cf3fd92593126d', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:26:03', '2026-04-25 11:26:03', '2026-05-02 14:26:03'),
('d88f23be1488c7c9a57aade3b1d825ac', 9, '682bef7c44f38e7f7d79106911ecdfbc7fe06d6b2ed0183ef2c10f0bf7b0e0a174ce9d595b636e255782585dc63e4beeccda90cceafa266fb76602f61e9e90c6', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:56:28', '2026-04-25 10:56:28', '2026-05-02 13:56:28'),
('d92572c2e221c8ce919bd56b06ce6fa2', 9, '1e8befa4d08dd51674f7f61922e665965ced88a1bc514007bca2e6e3c020513f585d4e973bda7485294ac1e07029022a27d7ffe94dc110cd76e1e87f4038668b', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:12:20', '2026-04-25 11:12:20', '2026-05-02 14:12:20'),
('d96ad9c4830c376402dba9c10aa37332', 6, '3b7bf59d142bb801bd48cc1df448c2e18c4a3ac705d8622ad8ac5e9b08cf235e998e6c4174645bfbfd22fbf09b2f3d961b99d03c4fc6b457623bb65271380dfa', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:15:31', '2026-04-25 10:15:31', '2026-05-02 13:15:31'),
('df1fbc3c4b61e93c76952af187fd28f4', 1, 'a8fe1c3d727e27cf6956a3d33393f128a4a8293c06d67b0e9eb638adbea18d80e13e70ad09391636d0804702edc0bc6d397f30d2ea52d8111a0720899a1baac0', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:02:42', '2026-04-25 10:02:42', '2026-05-02 13:02:42'),
('e02c19a2c1aadd8434932ff75693e155', 9, '8d69642a83506e7965c1ad98cef2ae4b4b2308711999982794c3f66231044766c76536bb3a1fda2562f2bc84689ecbd71442e1bd0ef4dfacf4c3f368e9271d85', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:17:29', '2026-04-25 11:17:29', '2026-05-02 14:17:29'),
('e27ad3e5ee2b6a47a3dac93aebedc958', 9, '9b6c7b17cbeb9f5956de179b6194f74d8767b9a750661d24b1b84ccc16837d79adbaf98acccf813e0602b2e3985fad5fa2b7a4e43448b78f2b821706bdd195ae', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 12:10:24', '2026-04-25 12:10:24', '2026-05-02 15:10:24'),
('e67d6cdcb53f1341941b3a584a46cae8', 6, '2caef2acc898e2e2baf5f4828b5a3d99d0c96fc9e3e9684e16dabccbd75cc9bd83644d3f05fabbed10b8c5ae846f3edad7116b0e1406e90a031b8953a9cc4324', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:55:45', '2026-04-25 11:55:45', '2026-05-02 14:55:45'),
('ebeceb1518656f7797a0860941889412', 1, 'bad0c1259863a16cffec0427ce122292e6b0ce9fa8dd2c5a8fc79fd135b7829fe6d1a9824231c2352c9057037bc5e90c98ce4ae49d29335286f424798a167438', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:19:42', '2026-04-25 10:19:42', '2026-05-02 13:19:42'),
('ed0d585d93baa849fd02a4d436342b73', 1, '0363aff1fe00667964004fa37b81f8ba8bf7b19e03d72688a4d03b45172775a07ed576ef848a75f2c1fd6e0a13b3588cb2825c05c11cd7db01ec5c3742d31690', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:21:46', '2026-04-25 10:21:46', '2026-05-02 13:21:46'),
('ee7e493fecc92d453514e561fe0f60a2', 6, '3916964c0d5ae34544d6e93d1ad9e9f8b71917d873553012207a4a6f0c8329c78939a209561e700767dd6c275437fbe8e1fa1dfbe3e882ad65fec4ddaf51fcab', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 11:50:08', '2026-04-25 11:50:08', '2026-05-02 14:50:08'),
('f1d2d75115f22a0aab079f0f4d717d0d', 6, '89957ccb7fab898636c79ad84008b5c59ba13f5f2fd8bc31221a79e33d258e3bb978a1a07c2f4eb59c9b9a37ddf981848dd2afa3662d09f6321102d9925c1d2b', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:03:45', '2026-04-25 10:03:45', '2026-05-02 13:03:45'),
('f256583e83b8fccf395168ca8976c120', 6, '9ff42f63f500b143a56b7e94d4e27aa110abdf38f61f15b4651dd7ddf6a3006541448ae7b530521f4001bbafe3b3eae17311abf9bebbffdb0ac11b540433aff4', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:19:50', '2026-04-25 10:19:50', '2026-05-02 13:19:50'),
('f29e54303a1e4e8662497482a4ed10de', 9, '5378de0684f384607b1b9b4c79dd592bf16a28852e93ace6e00bce69851c956d3f92e3823e81172627f65a85101bce6ce4aa1e55aaa31a69850b4da7338ef166', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 YaBrowser/26.3.0.0 Safari/537.36', 'Web Browser', 1, '2026-04-25 10:38:34', '2026-04-25 10:38:34', '2026-05-02 13:38:34');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `chats`
--
ALTER TABLE `chats`
  ADD PRIMARY KEY (`id`),
  ADD KEY `created_by` (`created_by`),
  ADD KEY `idx_type` (`type`),
  ADD KEY `idx_school` (`school_id`),
  ADD KEY `idx_last_message` (`last_message_id`);

--
-- Индексы таблицы `chat_participants`
--
ALTER TABLE `chat_participants`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_chat_user` (`chat_id`,`user_id`),
  ADD KEY `idx_user_active` (`user_id`,`is_active`);

--
-- Индексы таблицы `classes`
--
ALTER TABLE `classes`
  ADD PRIMARY KEY (`id`),
  ADD KEY `school_id` (`school_id`),
  ADD KEY `teacher_id` (`teacher_id`),
  ADD KEY `idx_school_grade` (`school_id`,`grade`);

--
-- Индексы таблицы `class_subjects`
--
ALTER TABLE `class_subjects`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_class_subject` (`class_id`,`subject_id`),
  ADD KEY `subject_id` (`subject_id`),
  ADD KEY `teacher_id` (`teacher_id`);

--
-- Индексы таблицы `favorite_messages`
--
ALTER TABLE `favorite_messages`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_user_message` (`user_id`,`message_id`),
  ADD KEY `message_id` (`message_id`);

--
-- Индексы таблицы `invitation_codes`
--
ALTER TABLE `invitation_codes`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `code` (`code`),
  ADD KEY `created_by` (`created_by`),
  ADD KEY `idx_school` (`school_id`);

--
-- Индексы таблицы `messages`
--
ALTER TABLE `messages`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_chat_created` (`chat_id`,`created_at`),
  ADD KEY `idx_sender` (`sender_id`),
  ADD KEY `idx_replied_to` (`replied_to`),
  ADD KEY `idx_deleted` (`is_deleted`);

--
-- Индексы таблицы `message_reactions`
--
ALTER TABLE `message_reactions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_reaction` (`message_id`,`user_id`,`reaction`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `message_read_status`
--
ALTER TABLE `message_read_status`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_message_user` (`message_id`,`user_id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `message_reports`
--
ALTER TABLE `message_reports`
  ADD PRIMARY KEY (`id`),
  ADD KEY `message_id` (`message_id`),
  ADD KEY `reported_by` (`reported_by`),
  ADD KEY `idx_status` (`status`),
  ADD KEY `message_reports_ibfk_3` (`reviewed_by`);

--
-- Индексы таблицы `schools`
--
ALTER TABLE `schools`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `number` (`number`);

--
-- Индексы таблицы `school_statistics`
--
ALTER TABLE `school_statistics`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_school_date` (`school_id`,`date`),
  ADD KEY `idx_date` (`date`);

--
-- Индексы таблицы `security_logs`
--
ALTER TABLE `security_logs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_user` (`user_id`),
  ADD KEY `idx_event_type` (`event_type`),
  ADD KEY `idx_created_at` (`created_at`);

--
-- Индексы таблицы `subjects`
--
ALTER TABLE `subjects`
  ADD PRIMARY KEY (`id`),
  ADD KEY `school_id` (`school_id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `email` (`email`),
  ADD KEY `idx_school` (`school_id`),
  ADD KEY `idx_role` (`role`),
  ADD KEY `idx_online` (`is_online`),
  ADD KEY `parent_id` (`parent_id`),
  ADD KEY `users_ibfk_2` (`class_id`);

--
-- Индексы таблицы `user_sessions`
--
ALTER TABLE `user_sessions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_user_id` (`user_id`),
  ADD KEY `idx_token` (`token`(255)),
  ADD KEY `idx_expires` (`expires_at`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `chats`
--
ALTER TABLE `chats`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=314;

--
-- AUTO_INCREMENT для таблицы `chat_participants`
--
ALTER TABLE `chat_participants`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=971;

--
-- AUTO_INCREMENT для таблицы `classes`
--
ALTER TABLE `classes`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT для таблицы `class_subjects`
--
ALTER TABLE `class_subjects`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `favorite_messages`
--
ALTER TABLE `favorite_messages`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `invitation_codes`
--
ALTER TABLE `invitation_codes`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `messages`
--
ALTER TABLE `messages`
  MODIFY `id` bigint NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=33;

--
-- AUTO_INCREMENT для таблицы `message_reactions`
--
ALTER TABLE `message_reactions`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `message_read_status`
--
ALTER TABLE `message_read_status`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1047;

--
-- AUTO_INCREMENT для таблицы `message_reports`
--
ALTER TABLE `message_reports`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `schools`
--
ALTER TABLE `schools`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `school_statistics`
--
ALTER TABLE `school_statistics`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `security_logs`
--
ALTER TABLE `security_logs`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=145;

--
-- AUTO_INCREMENT для таблицы `subjects`
--
ALTER TABLE `subjects`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `chats`
--
ALTER TABLE `chats`
  ADD CONSTRAINT `chats_ibfk_1` FOREIGN KEY (`created_by`) REFERENCES `users` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `chats_ibfk_2` FOREIGN KEY (`school_id`) REFERENCES `schools` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `chat_participants`
--
ALTER TABLE `chat_participants`
  ADD CONSTRAINT `chat_participants_ibfk_1` FOREIGN KEY (`chat_id`) REFERENCES `chats` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `chat_participants_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `classes`
--
ALTER TABLE `classes`
  ADD CONSTRAINT `classes_ibfk_1` FOREIGN KEY (`school_id`) REFERENCES `schools` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `classes_ibfk_2` FOREIGN KEY (`teacher_id`) REFERENCES `users` (`id`) ON DELETE SET NULL;

--
-- Ограничения внешнего ключа таблицы `class_subjects`
--
ALTER TABLE `class_subjects`
  ADD CONSTRAINT `class_subjects_ibfk_1` FOREIGN KEY (`class_id`) REFERENCES `classes` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `class_subjects_ibfk_2` FOREIGN KEY (`subject_id`) REFERENCES `subjects` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `class_subjects_ibfk_3` FOREIGN KEY (`teacher_id`) REFERENCES `users` (`id`) ON DELETE SET NULL;

--
-- Ограничения внешнего ключа таблицы `favorite_messages`
--
ALTER TABLE `favorite_messages`
  ADD CONSTRAINT `favorite_messages_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `favorite_messages_ibfk_2` FOREIGN KEY (`message_id`) REFERENCES `messages` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `invitation_codes`
--
ALTER TABLE `invitation_codes`
  ADD CONSTRAINT `invitation_codes_ibfk_1` FOREIGN KEY (`created_by`) REFERENCES `users` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `invitation_codes_ibfk_2` FOREIGN KEY (`school_id`) REFERENCES `schools` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `messages`
--
ALTER TABLE `messages`
  ADD CONSTRAINT `messages_ibfk_1` FOREIGN KEY (`chat_id`) REFERENCES `chats` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `messages_ibfk_2` FOREIGN KEY (`sender_id`) REFERENCES `users` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `messages_ibfk_3` FOREIGN KEY (`replied_to`) REFERENCES `messages` (`id`) ON DELETE SET NULL;

--
-- Ограничения внешнего ключа таблицы `message_reactions`
--
ALTER TABLE `message_reactions`
  ADD CONSTRAINT `message_reactions_ibfk_1` FOREIGN KEY (`message_id`) REFERENCES `messages` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `message_reactions_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `message_read_status`
--
ALTER TABLE `message_read_status`
  ADD CONSTRAINT `message_read_status_ibfk_1` FOREIGN KEY (`message_id`) REFERENCES `messages` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `message_read_status_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `message_reports`
--
ALTER TABLE `message_reports`
  ADD CONSTRAINT `message_reports_ibfk_1` FOREIGN KEY (`message_id`) REFERENCES `messages` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `message_reports_ibfk_2` FOREIGN KEY (`reported_by`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `message_reports_ibfk_3` FOREIGN KEY (`reviewed_by`) REFERENCES `users` (`id`) ON DELETE SET NULL;

--
-- Ограничения внешнего ключа таблицы `school_statistics`
--
ALTER TABLE `school_statistics`
  ADD CONSTRAINT `school_statistics_ibfk_1` FOREIGN KEY (`school_id`) REFERENCES `schools` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `security_logs`
--
ALTER TABLE `security_logs`
  ADD CONSTRAINT `security_logs_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE SET NULL;

--
-- Ограничения внешнего ключа таблицы `subjects`
--
ALTER TABLE `subjects`
  ADD CONSTRAINT `subjects_ibfk_1` FOREIGN KEY (`school_id`) REFERENCES `schools` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `users`
--
ALTER TABLE `users`
  ADD CONSTRAINT `users_ibfk_1` FOREIGN KEY (`school_id`) REFERENCES `schools` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `users_ibfk_2` FOREIGN KEY (`class_id`) REFERENCES `classes` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `users_ibfk_3` FOREIGN KEY (`parent_id`) REFERENCES `users` (`id`) ON DELETE SET NULL;

--
-- Ограничения внешнего ключа таблицы `user_sessions`
--
ALTER TABLE `user_sessions`
  ADD CONSTRAINT `user_sessions_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
